"""
Напишите программу, которая на входе получает имя пользователя, 
сохраняет его в переменную user_name и выводит строку  "Hello {user_name}!" 
"""
# user_name = input()
# print(f'Hello {user_name}!')

'''
Напишите программу, которая на входе получает 2 числа, 
производит с ними арифметическую операцию(на ваше усмотрение), и выводит “Результат = {результат}”
'''
# num_1 = int(input())
# num_2 = int(input())
# print('Результат =', num_1 // num_2 ** (-1))

'''
Напишите программу, чтобы вывести:
      
*********
*            *
*            *
*********
'''
# a = '*' * 9
# b = '*' + ' ' * 12 + '*'
# print(a, b, b, a, sep = '\n')

'''
Напишите программу для нахождения цифр четырёхзначного числа. 
Число вводится при помощи методa input()
'''
# number = int(input())
# print('Тысячи -', number // 1000)
# print('Сотни -', number % 1000 // 100)
# print('Десятки -', number % 100 // 10)
# print('Единицы -', number % 10)